# Git - это распределенная система контроля версий. 
# Это система для отслеживания и ведения истории, изменение файлов в вашем проекте. 

# Репозиторий - хранилище вашего кода и истории его изменений. 

# Github - вебсайт, для размещения гит-репозиториев и совместной разработки проектов. 

# Команда Git:

#1 git init - создает новый гит-репозиторий локально на вашем пк. 

#2 git commmit - как только мы достигаем опредленного момента в разработке, то тогда мы сохраняем и комментируем наши изменения.
# git commit -m '<комментарий>'

# 3 git branch - ветки, они очень важны git. При помощи веток несколько разработчиков могут работать парралельно на одном проекте. 
# При помощи команды git branch мы можем создать, просматривать или удалять ветки.
# Создание ветки: git branch <nameofBranch> 
# Просмотр веток: git branch or git branch --list
# Удаление: git branch -d <name_of_branch> 

# 4 Git remote add - это команда для того, чтобы связать ваш проект с удаленным репозиторием.
# git remote add <название подключения> 
# <ссылка на репозиторий> 

# 5. git add - когда мы создаем или изменяем файлы, при помощи мы загружаем все изменения в локальное хранилище

# git add <название файла> 
# git add . 

# 6. git push - после коммита изменений при помощи этой команды мы отправляем наши изменения на удаленный репозиторий 



























